Revit 2027 API
PipeFittingAndAccessoryData.Origin Property
 The origin position of the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; }
Public ReadOnly Property Origin As XYZ
	Get
public:
property XYZ^ Origin {
	XYZ^ get ();
}
member Origin : XYZ with get
Property Value
XYZ
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace